ODC-2022/includes/demo/Práctica 1.tex
% Created 2022-08-14 dom 12:14
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\newcommand{\tagline}{Práctica 1}
\usepackage[spanish]{babel}
\usepackage{geometry}
\geometry{ a4paper, left=.75in, right=.75in, top=1in, bottom=1in }
\makeatletter
\newcommand{\asignatura}{Arquitectura de Computadoras (331)}
\newcommand{\docente}{Arturo Arreola Alvarez}
\author{Luis Eduardo Galindo Amaya \\
1274895}
\date{2022-08-14}
\title{Elementos En La Organización De Una \\
Computadora De Propósito General}
\hypersetup{
 pdfauthor={Luis Eduardo Galindo Amaya \\
1274895},
 pdftitle={Elementos En La Organización De Una \\
Computadora De Propósito General},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Spanish}}
\begin{document}

\begin{titlepage}
  \vspace*{0.75in}
  \begin{flushleft} 
	\sffamily      
    
	\large
    \tagline

	\Huge
    \@title \\
    \vspace{0.25in}
    \hline
    \vspace{0.25in}
	% \vspace{0.50in}

    \Large
    \@author
    
    
    \vspace*{\fill}
	
    \large
    \begin{tabular}{ |l|l| }
      \hline
      Asignatura & \asignatura \\
      Docente & \docente \\
      Fecha & \@date \\
      \hline
    \end{tabular} \\
\end{titlepage}

\setlength\parindent{0pt} 
% \maketitle

\section*{Información De La Practica}
\label{sec:org36a5492}

\subsection*{Objetivo}
\label{sec:org8cb286c}
El alumno se familiarizará con la herramienta Marie.js para la ejecución de código en lenguaje ensamblador.

\subsection*{Equipo}
\label{sec:orgccacf9b}
Computadora personal con acceso a Internet.

\subsection*{Desarrollo}
\label{sec:orgf14d666}
\begin{itemize}
\item Ingrese a la página donde se encuentra la herramienta.

\item Consulte la documentación y tutoriales de Marie, en especial las secciones Introduction to Marie y Marie Codes.

\item Escriba un código que solicite al usuario 2 números y despliegue el resultado de la ecuación 2x+3y–5.

\item Escriba un código que solicite 2 números y los reste. Desplegar un 1 si el resultado fue negativo o un 0 en caso contrario.

\item Realice capturas de pantalla donde se muestre el funcionamiento de los programas.

\item Realizar un reporte que incluya: 
\begin{itemize}
\item Diagrama de bloques de una máquina de von Neumann y una breve descripción de cada componente.

\item Lista de las instrucciones de Marie y su y su función.

\item Describir el funcionamiento de los registros del Acumulador, Registro de instrucción, Contador del Programa, Registro de Acceso a Memoria (MAR), y Registro de Buffer de Memoria (MBR).
\end{itemize}

\item Al entregar su práctica, adjunte los códigos de sus programas y su reporte.
\end{itemize}
\end{document}
